# Props to:
# http://javapapo.blogspot.com/2015/08/my-macosx-app-setup-list-using-brew-and.html
# https://checknotes.wordpress.com/2015/12/26/mac-os-x-setup-guide/
# Thanks for the awesome brew packages listed

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Recent versions of some macOS tools.
brew 'coreutils'
brew 'findutils'
brew 'gcc', args: ['without-multilib']
brew 'git'
brew 'python'
brew 'python3'
brew 'vim', args: ['with-override-system-vi', 'with-python3']
brew 'zsh'
brew 'zsh-completions'

# Other useful binaries.
brew 'go'
brew 'htop'
brew 'httpie'
brew 'httrack'
brew 'lua'
brew 'node'
brew 'speedtest_cli'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'uncrustify'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
cask 'java'

# Fonts
cask 'font-roboto-mono-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'

# Apps
cask 'airdroid'
cask 'android-file-transfer'
cask 'android-sdk'
cask 'android-studio'
cask 'android-studio-preview'
cask 'cheatsheet'
cask 'cyberghost'
cask 'dash'
cask 'docker'
cask 'docker-toolbox'
cask 'dolphin'
cask 'firefox'
cask 'flux'
cask 'gitter'
cask 'goofy'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'intellij-idea'
cask 'iterm2'
cask 'karabiner'
cask 'keepingyouawake'
cask 'keycastr'
cask 'microsoft-office'
cask 'ngrok'
cask 'openemu'
cask 'postman'
cask 'securedownloadmanager'
cask 'seil'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'typora'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xquartz'
